TD7/WSCalc/calculatrice.add.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="urn:calculatrice">
 <SOAP-ENV:Body>
  <ns:add>
   <op1>0</op1>
   <op2>0</op2>
  </ns:add>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
